<a href='https://github.com/SeWonKwon' ><div> <img src ='https://slid-capture.s3.ap-northeast-2.amazonaws.com/public/image_upload/6556674324ed41a289a354258718280d/964e5a8b-75ad-41fc-ae75-0ca66d06fbc7.png' align='left' /> </div></a>

In [1]:
import numpy as np
import pandas as pd

DataFrame

* 2차원 형태의 자료형이다.
* 인덱스, 컬럼, value값으로 이루어져 있다.

In [2]:
import pandas as pd
import numpy as np

# 선언

## from List

- by List : 리스트1 + 리스트2 +... + 컬럼 이름 = 데이타 프레임

In [3]:
a = [1, 3, 4, 5, 6]
b = [3, 2, 1, 1, 1]
pd.DataFrame([a,b])

   0  1  2  3  4
0  1  3  4  5  6
1  3  2  1  1  1

In [4]:
pd.DataFrame({'a':a, 'b':b})

   a  b
0  1  3
1  3  2
2  4  1
3  5  1
4  6  1

In [5]:
list_data = [[1,2,3],[4,5,6], [7,8,9],[10,11,12],[13,14,15]]
pd.DataFrame(list_data)

    0   1   2
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12
4  13  14  15

## from dict

In [6]:
pd.DataFrame([{'A':2, 'B':4, 'D':3},{'A':4, 'B':5, 'C':7}])

   A  B    D    C
0  2  4  3.0  NaN
1  4  5  NaN  7.0

In [7]:
dict_data = {'c0':[1,2,3],'c1':[4,5,6],'c2' : [7,8,9],'c3' : [10,11,12], 'c4':[13,14,15]}
pd.DataFrame(dict_data)

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

## Series 와 비교를 해보자면

* Series 는 1차원이기 때문에 key 값이 1개라면 Series가 된다. 
* DataFrame 은 2차원이기 때문에 key 값이 2개가 필요하다.
    - 만약 키 값이 1개면, 그 키값은 column에 우선 할당되고, 인덱스는 자동 설정된다.

In [8]:
male_tuple = {'서울특별시': 4732275,
              '부산광역시': 1668618,
              '인천광역시': 1476813,
              '대구광역시': 1198815,
              '대전광역시': 734441,
              '광주광역시': 720060}
female_tuple = {'서울특별시': 4988571,
                '부산광역시': 1735805,
                '인천광역시': 1470404,
                '대구광역시': 1229139,
                '대전광역시': 736599,
                '광주광역시': 734988}

In [9]:
pd.Series(male_tuple)

서울특별시    4732275
부산광역시    1668618
인천광역시    1476813
대구광역시    1198815
대전광역시     734441
광주광역시     720060
dtype: int64

In [10]:
pd.Series(male_tuple).index

Index(['서울특별시', '부산광역시', '인천광역시', '대구광역시', '대전광역시', '광주광역시'], dtype='object')

In [11]:
pd.Series([male_tuple,female_tuple])

0    {'서울특별시': 4732275, '부산광역시': 1668618, '인천광역시': ...
1    {'서울특별시': 4988571, '부산광역시': 1735805, '인천광역시': ...
dtype: object

In [12]:
pd.Series([male_tuple,female_tuple]).index

RangeIndex(start=0, stop=2, step=1)

In [13]:
pd.DataFrame([male_tuple,female_tuple])

     서울특별시    부산광역시    인천광역시    대구광역시   대전광역시   광주광역시
0  4732275  1668618  1476813  1198815  734441  720060
1  4988571  1735805  1470404  1229139  736599  734988

In [14]:
pd.DataFrame([male_tuple,female_tuple]).index

RangeIndex(start=0, stop=2, step=1)

## from Series

- by Series :시리즈1 + 시리즈2 + 시리즈3 + 시리즈4 = 데이타프레임

In [15]:
male = pd.Series(male_tuple)
female = pd.Series(female_tuple)

* 아래와 같이 되는 이유는 각각의 value 값에 대응한 시리즈의 index가 컬럼으로 바뀌기 때문이다. 
    - 만약 키 값이 1개면, 그 키값은 column에 우선 할당되고, 인덱스는 자동 설정된다.

In [16]:
pd.DataFrame([male, female])

     서울특별시    부산광역시    인천광역시    대구광역시   대전광역시   광주광역시
0  4732275  1668618  1476813  1198815  734441  720060
1  4988571  1735805  1470404  1229139  736599  734988

간단하게 전치를 해서 컬럼과 인덱스를 바꿀수도 있지만,

In [17]:
pd.DataFrame([male, female]).T

             0        1
서울특별시  4732275  4988571
부산광역시  1668618  1735805
인천광역시  1476813  1470404
대구광역시  1198815  1229139
대전광역시   734441   736599
광주광역시   720060   734988

### 아래와 같이 컬럼값을 지정해서 Series의 index를 DataFrame의 키값으로 변형할 수 있다. 

**DataFrame 생성시에 column을 적어주느냐와 안적어주느냐는 큰 차이가 있다.**

In [18]:
pd.DataFrame({'남자인구수': male, '여자인구수':female})

         남자인구수    여자인구수
서울특별시  4732275  4988571
부산광역시  1668618  1735805
인천광역시  1476813  1470404
대구광역시  1198815  1229139
대전광역시   734441   736599
광주광역시   720060   734988

### Series 가 가지는 의미

In [19]:
sr1 = sr1 = pd.Series(['php', 'python', 'java', 'c#', 'c++'])
sr2 = pd.Series(np.arange(1, 6))
sr1, sr2

(0       php
 1    python
 2      java
 3        c#
 4       c++
 dtype: object,
 0    1
 1    2
 2    3
 3    4
 4    5
 dtype: int32)

위와 같이 2개의 시리즈를 생성하고, 아래와 같이 DataFrame을 생성하게 되면

In [20]:
ser_df = pd.DataFrame(sr1, sr2)
ser_df

        0
1  python
2    java
3      c#
4     c++
5     NaN

`data = sr1, index=sr2` 가 되는데 sr2의 밸류값에 해당하는 것이 index가 되고 , data의 index가 sr2의 밸류값에 포함 되는것만 불러 오게 된다.

## from np.random

In [21]:
pd.DataFrame(np.random.randn(4,4))

          0         1         2         3
0 -1.984623 -0.392690 -0.359347  2.657029
1  0.550295  0.912160  0.440870 -2.015142
2  0.315918  0.643219  0.806273 -1.926822
3 -0.356346 -0.737883  1.966542 -0.773075

In [22]:
pd.DataFrame(np.random.randint(1, 7, (7,7)))

   0  1  2  3  4  5  6
0  2  1  4  1  5  2  4
1  2  3  6  5  2  2  6
2  2  4  5  3  6  5  1
3  1  3  3  2  1  3  3
4  1  2  5  4  6  5  2
5  2  4  2  4  2  5  3
6  1  3  4  1  2  3  2

In [23]:
nrows, ncols = 10, 10
df1, df2, df3, df4 = (pd.DataFrame(np.random.rand(nrows, ncols)) for i in range(4))
df3

,0,1,2,3,4,5,6,7,8,9
0,0.419723,0.104804,0.684428,0.740170,0.657245,0.563143,0.419598,0.677526,0.742913,0.886233
1,0.989313,0.093138,0.262831,0.040905,0.197387,0.884418,0.527986,0.451369,0.201008,0.671032
2,0.729023,0.669467,0.833627,0.269516,0.866635,0.449915,0.971351,0.855615,0.857492,0.066653
3,0.496764,0.759909,0.044250,0.709952,0.489423,0.497301,0.315947,0.068404,0.880208,0.463121
4,0.001131,0.725085,0.375199,0.562328,0.883403,0.293638,0.244081,0.998120,0.455643,0.332824
5,0.060659,0.385292,0.882077,0.690713,0.717133,0.993262,0.018170,0.146279,0.934091,0.917872
6,0.681530,0.502894,0.031697,0.485955,0.718183,0.190619,0.002516,0.450647,0.998794,0.294609
7,0.947050,0.325948,0.106933,0.323214,0.958319,0.870060,0.228520,0.525892,0.510929,0.669550
8,0.433829,0.860680,0.903867,0.146177,0.502572,0.913498,0.341753,0.628326,0.355221,0.705441
9,0.213883,0.343974,0.117358,0.408066,0.981450,0.179939,0.404426,0.619486,0.927032,0.560670

## OrderedDict로 데이터프레임 생성하기
OrderedDict 자료구조로 데이터프레임을 생성하면, 컬럼의 순서가 뒤바뀌지 않습니다.

In [24]:
from collections import OrderedDict

In [25]:
friend_ordered_dict = OrderedDict([ ('name', ['John', 'Jenny', 'Nate']),
          ('age', [20, 30, 30]),
          ('job', ['student', 'developer', 'teacher']) ] )
df = pd.DataFrame.from_dict(friend_ordered_dict)
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

## from other sauce

* pd.read_csv 등등 수많은 sauce( html, json, 등등)

## from other DataFrame

- by other dataframe's columns : 컬럼1 + 컬럼2  +...= 데이타 프레임 
- by other dataframe's columns : dfA 컬럼 1 + dfB 컬럼 2   +...= 데이타 프레임

In [26]:
df1 = pd.DataFrame(np.random.randn(5,3), index=pd.date_range('01/02/2014',periods=5,freq='D'), columns=['a','b','c'] )
df2 = pd.DataFrame(np.random.randn(8,3), index=pd.date_range('01/01/2014',periods=8,freq='D'), columns=['a','b','c'] )

In [27]:
df1

                   a         b         c
2014-01-02 -0.637262  0.173798  1.095872
2014-01-03  0.067398  1.222855 -3.142215
2014-01-04 -0.288442 -0.755362  1.711627
2014-01-05 -0.013729 -2.050322 -0.776874
2014-01-06  1.098360  1.365967  0.014158

In [28]:
df1['a']

2014-01-02   -0.637262
2014-01-03    0.067398
2014-01-04   -0.288442
2014-01-05   -0.013729
2014-01-06    1.098360
Freq: D, Name: a, dtype: float64

In [29]:
# 시리즈를 2개 묶은것
pd.DataFrame([df1['a'],df2['b']])

,2014-01-01,2014-01-02,2014-01-03,2014-01-04,2014-01-05,2014-01-06,2014-01-07,2014-01-08
a,NaN,-0.637262,0.067398,-0.288442,-0.013729,1.09836,NaN,NaN
b,-1.06095,-0.122652,0.328710,0.482223,0.814080,-0.42503,-0.155491,-0.721873

In [30]:
pd.DataFrame({'a':df1['a'], 'b': df2['b']})

                   a         b
2014-01-01       NaN -1.060950
2014-01-02 -0.637262 -0.122652
2014-01-03  0.067398  0.328710
2014-01-04 -0.288442  0.482223
2014-01-05 -0.013729  0.814080
2014-01-06  1.098360 -0.425030
2014-01-07       NaN -0.155491
2014-01-08       NaN -0.721873

In [31]:
pd.DataFrame(df1[['a','b']])

                   a         b
2014-01-02 -0.637262  0.173798
2014-01-03  0.067398  1.222855
2014-01-04 -0.288442 -0.755362
2014-01-05 -0.013729 -2.050322
2014-01-06  1.098360  1.365967

In [32]:
pd.DataFrame({'a':df1['a'], 'b':df1['b']})

                   a         b
2014-01-02 -0.637262  0.173798
2014-01-03  0.067398  1.222855
2014-01-04 -0.288442 -0.755362
2014-01-05 -0.013729 -2.050322
2014-01-06  1.098360  1.365967

## from `pd.util.testing.`

In [33]:
print("DataFrame: Contains random values:")
df1 = pd.util.testing.makeDataFrame() # contains random values
print(df1)
print("\nDataFrame: Contains missing values:")
df2 = pd.util.testing.makeMissingDataframe() # contains missing values
print(df2)
print("\nDataFrame: Contains datetime values:")
df3 = pd.util.testing.makeTimeDataFrame() # contains datetime values
print(df3)
print("\nDataFrame: Contains mixed values:")
df4 = pd.util.testing.makeMixedDataFrame() # contains mixed values
print(df4)

DataFrame: Contains random values:
                   A         B         C         D
PBsMIvXcx0  0.243627 -0.665386  0.944920  0.993559
jRERLcEjSQ  0.650476  0.161242 -1.361043  1.976693
vN77i2yrhq -0.861248  1.544544  0.053481 -0.140764
251KNTDfqz  1.233136 -1.032120  1.841870  0.373382
u5urzfNyni  1.253370 -0.484688  0.793000 -0.197074
0L3il9k3T1 -0.665207  0.107570  0.504116  0.107222
keiPAcbnXG  1.403600  1.172421  0.794845  0.277757
DuCeqx2vkC  0.337488 -2.758306  0.705180  0.397605
luK4PvgEvP  0.080224  0.904530 -0.406527  0.147349
Jj13dUa8cv  1.090477  2.023480 -0.613676  0.321621
KBxFcTtQyN  1.427026 -0.556243 -0.329598 -0.774396
vQXxd69RHi -1.525502  0.634009 -3.654458 -0.246885
E1fm9DGy0H -0.122249  0.880252  2.127936  0.114722
8fKOw2yJvM -1.850335 -0.989098 -1.407581  0.003031
SUBlAxLkWS  0.212190 -0.299751  0.710796  2.423680
naSkYz0Zks  0.762494 -0.318544  0.731610  0.298315
kajWB0FiZX -0.683979  0.902372 -0.008842  1.339335
yiGD35VO4B -0.506637  0.213086  0.150344 -0.327256
R1DN1G3TXl  0.114655  1.452086 -0.624368 -0.354430
MZFt69ENoM  0.396645  0.148328 -1.064080  0.056284
vRLIjJTSeV -0.033111  1.547759  0.538082  0.690745
Lm3TgXRGgL  2.304028  0.364532 -0.364080  0.334251
JYJPboRgW5 -0.082905 -0.107334  0.638181  0.284313
Ur6Ft82Svo  0.288644 -1.211365  1.368250  0.936985
gbgA7cjrrf  1.789864 -0.204368  1.026313 -1.128327
CpvmyxX6wW -0.933506  1.812371 -0.307731 -1.889681
NTZVfuKrUA  0.334951 -0.995524  0.928217  0.164191
q9kfVguRPv -1.114323 -0.915047 -0.981592  0.588442
JkUDtDcoan -0.433859 -0.528856  1.210365 -0.811713
NwGMYGAx62  0.699328  1.391211  1.873497 -0.383574

DataFrame: Contains missing values:
                   A         B         C         D
UaWD0gj91T  0.056821  0.450309 -0.020261 -0.636505
4QFmwzpyk7 -2.074572  0.380418       NaN -0.807626
ZUGInzsV0C  0.091363  0.475641 -1.451837       NaN
pEVF3OYP0w  1.302694 -1.937158 -1.568275 -0.314194
v8OyDDqhiY       NaN  1.135981  0.982594  2.771936
6djraXSeOr  0.130048  0.210132 -0.214254       NaN
sk0WLclJ4N -1.074177  1.132053 -1.245528  1.870608
HxNqAACylX -1.197497  0.771578  0.892277  0.055817
PPuoV95Qgl  1.139841  1.231360  0.353041  1.715971
EPZDB9cat2  1.732727 -1.083028       NaN  0.187599
7SpauOL0vq -0.269874 -1.126712  0.051234  0.645866
Q8V7iRkL2M  0.488684  0.149292 -0.016637  0.801734
v7ehgev5qB  1.329087 -0.156674 -2.130538 -1.840629
o1ZWg8MeXZ       NaN -1.531308 -0.077448       NaN
8CfDTHeaDd  0.072626       NaN -1.467702  0.950542
GBkeKmSH0n -0.188046 -0.096336 -0.083049 -0.890908
XuX4PRF7Lt  1.645788  1.227766 -2.049384  1.480282
6lGWcgAA8d  0.789760 -0.064591       NaN -1.040297
2gjwX6G6TB -0.623218 -0.849421  0.020978 -0.087493
FxtHplAWRa -1.401757  0.065553  1.480817 -0.698129
qFJACjopt4 -0.390887 -0.254411       NaN -1.289702
XDRBL6me3v -1.017376  0.338674 -0.287229  1.386692
Dvif9EzgpY -0.702457  2.120879 -0.321732 -0.329233
efmLuF0yzz  1.460761  0.998051       NaN  0.711998
LCquwqwnpV -1.629006  0.028514  0.264862  0.850698
4O601cQmmH  0.747899  0.301382 -1.493397 -0.189451
HaQmbEGXtV -0.759138  0.898523  0.069190 -1.105267
zmjBj2w7nE -0.774281  0.650304 -0.589305  1.671586
f9FS9cGEMH -0.305281 -0.663850 -0.705554       NaN
UCWXgKwUeM  2.409134  0.436679  1.412695 -1.299156

DataFrame: Contains datetime values:
                   A         B         C         D
2000-01-03 -0.181388 -1.265366 -2.401960  2.846762
2000-01-04  0.851737 -0.356823 -2.247427 -0.263575
2000-01-05  0.361650  0.548242  0.472074  0.062334
2000-01-06  0.511195  0.068806 -0.829526 -0.645694
2000-01-07  1.568063  0.571319 -0.630788  0.443358
2000-01-10  0.659130  1.067563 -0.692117  0.151195
2000-01-11 -0.215267 -0.725875  0.585880  0.632636
2000-01-12  0.378030  0.880746 -0.924090 -0.337134
2000-01-13  0.770267 -0.654365  0.603034 -0.708441
2000-01-14 -0.423511 -0.629019 -0.760332  0.099538
2000-01-17 -0.854161 -0.413476 -0.634872 -0.084016
2000-01-18 -0.273013  1.381453  1.526887 -0.159496
2000-01-19 -0.511949  0.286884 -1.321529 -1.384781
2000-01-20 -2.642429  0.068413  1.060781 -0.194916
2000-01-21  1.551333  0.336273  0.619097 -1.240018
2000-01-24 -1.834071  0.846415 -0.615169 -0.149979
2000-01-25 -0.644217  1.145104  0.193516  0.412676
2000-01-26  0.883369  0.044933  0.124269  1.532501
2000-01-27  0.559446 -1.443984  0.911784 -0.903433
2000-01-28 -0.171030 -0.629923 -0.559559 -0.493221
2000-01-31  0.621452  0.221854  0.621822  0.599407
2000-02-01 -0.483686  0.995627 -2.103064 -0.447249
2000-02-02 -0.364743  0.334898 -0.438703 -1.330956
2000-02-03  1.778728  0.283403  1.573774  1.449529
2000-02-04 -0.318715 -1.436368  0.184484 -1.548028
2000-02-07  0.029790  0.665037  2.133294  0.217615
2000-02-08 -2.408884  1.201106 -0.459797 -0.751644
2000-02-09 -0.695029  1.804044  1.357038 -0.638459
2000-02-10 -1.863166 -0.160590 -2.477871  0.416075
2000-02-11  0.556826  0.542493 -1.967254  0.264195

DataFrame: Contains mixed values:
     A    B     C          D
0  0.0  0.0  foo1 2009-01-01
1  1.0  1.0  foo2 2009-01-02
2  2.0  0.0  foo3 2009-01-05
3  3.0  1.0  foo4 2009-01-06
4  4.0  0.0  foo5 2009-01-07

C:\Users\bigne\anaconda3\lib\site-packages\pandas\util\__init__.py:12: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing

# 조회

## `info()` & `describe()`

## 조회 및 출력 `iterrows()`, `itertuples()`, `iteritems()`

In [31]:
import pandas as pd


df = pd.DataFrame({'A': list('ABCDABCDAB'), 'num': range(10)})

### `iterrows()`

In [32]:
for row in df.iterrows():
    print(row)
    break

(0, A      A
num    0
Name: 0, dtype: object)

In [33]:
for row in df.iterrows():
    print('key:', row[0], 'val:', row[1])
    break

key: 0 val: A      A
num    0
Name: 0, dtype: object

In [34]:
for k, v in df.iterrows():
    print(k, v['A'],v['num'])

0 A 0
1 B 1
2 C 2
3 D 3
4 A 4
5 B 5
6 C 6
7 D 7
8 A 8
9 B 9

### `itertuples()`

In [35]:
for t in df.itertuples():
    print("tuple", t)

tuple Pandas(Index=0, A='A', num=0)
tuple Pandas(Index=1, A='B', num=1)
tuple Pandas(Index=2, A='C', num=2)
tuple Pandas(Index=3, A='D', num=3)
tuple Pandas(Index=4, A='A', num=4)
tuple Pandas(Index=5, A='B', num=5)
tuple Pandas(Index=6, A='C', num=6)
tuple Pandas(Index=7, A='D', num=7)
tuple Pandas(Index=8, A='A', num=8)
tuple Pandas(Index=9, A='B', num=9)

In [36]:
for i, a, b in df.itertuples():
    print('index: ', i, 'A:', a, 'num:', b)

index:  0 A: A num: 0
index:  1 A: B num: 1
index:  2 A: C num: 2
index:  3 A: D num: 3
index:  4 A: A num: 4
index:  5 A: B num: 5
index:  6 A: C num: 6
index:  7 A: D num: 7
index:  8 A: A num: 8
index:  9 A: B num: 9

### `iteritems()`

In [37]:
for  a, b in df.iteritems():
    print( 'A:', a, 'num:', b)

A: A num: 0    A
1    B
2    C
3    D
4    A
5    B
6    C
7    D
8    A
9    B
Name: A, dtype: object
A: num num: 0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
Name: num, dtype: int64

출처: 
* <a href='https://github.com/SeWonKwon' ><div> <img src ='https://slid-capture.s3.ap-northeast-2.amazonaws.com/public/image_upload/6556674324ed41a289a354258718280d/964e5a8b-75ad-41fc-ae75-0ca66d06fbc7.png' align='left' /> </div></a>


<br>


* [이수안컴퓨터연구소](https://www.youtube.com/channel/UCFfALXX0DOx7zv6VeR5U_Bg)
* https://github.com/minsuk-heo/pandas